README.org
#+TITLE: from_zero_to_hero
#+SUBTITLE: A guidated tour in django from scratch to deploy
#+AUTHOR: littl3_R
#+EMAIL: littl3.R@littl3_R.com
#+DATE: 2022-04-19 14:45:05

#+LANGUAGE: en

#+TOC: table
#+TOC: listing

