README.org
* Set up the project
1. create a repository on *GitHub* then it suggests the follow commands
   #+begin_src bash
     echo "# django_zth" >> README.md
     git init
     git add README.md
     git commit -m "first commit"
     git branch -M main
     git remote add origin https://github.com/littl3-R/django_zth.git
     git push -u origin main
   #+end_src
2. install =pip=
3. create a new environment [[https://realpython.com/intro-to-pyenv/][pyenv]] and activate it
   1. new enviroment
   #+begin_src bash
     pyenv install --list # choose the python version e.g. pyenv install 3.10.2 
   #+end_src

   #+RESULTS:
   | Available              | versions: |
   | 2.1.3                  |           |
   | 2.2.3                  |           |
   | 2.3.7                  |           |
   | 2.4.0                  |           |
   | 2.4.1                  |           |
   | 2.4.2                  |           |
   | 2.4.3                  |           |
   | 2.4.4                  |           |
   | 2.4.5                  |           |
   | 2.4.6                  |           |
   | 2.5.0                  |           |
   | 2.5.1                  |           |
   | 2.5.2                  |           |
   | 2.5.3                  |           |
   | 2.5.4                  |           |
   | 2.5.5                  |           |
   | 2.5.6                  |           |
   | 2.6.0                  |           |
   | 2.6.1                  |           |
   | 2.6.2                  |           |
   | 2.6.3                  |           |
   | 2.6.4                  |           |
   | 2.6.5                  |           |
   | 2.6.6                  |           |
   | 2.6.7                  |           |
   | 2.6.8                  |           |
   | 2.6.9                  |           |
   | 2.7.0                  |           |
   | 2.7-dev                |           |
   | 2.7.1                  |           |
   | 2.7.2                  |           |
   | 2.7.3                  |           |
   | 2.7.4                  |           |
   | 2.7.5                  |           |
   | 2.7.6                  |           |
   | 2.7.7                  |           |
   | 2.7.8                  |           |
   | 2.7.9                  |           |
   | 2.7.10                 |           |
   | 2.7.11                 |           |
   | 2.7.12                 |           |
   | 2.7.13                 |           |
   | 2.7.14                 |           |
   | 2.7.15                 |           |
   | 2.7.16                 |           |
   | 2.7.17                 |           |
   | 2.7.18                 |           |
   | 3.0.1                  |           |
   | 3.1.0                  |           |
   | 3.1.1                  |           |
   | 3.1.2                  |           |
   | 3.1.3                  |           |
   | 3.1.4                  |           |
   | 3.1.5                  |           |
   | 3.2.0                  |           |
   | 3.2.1                  |           |
   | 3.2.2                  |           |
   | 3.2.3                  |           |
   | 3.2.4                  |           |
   | 3.2.5                  |           |
   | 3.2.6                  |           |
   | 3.3.0                  |           |
   | 3.3.1                  |           |
   | 3.3.2                  |           |
   | 3.3.3                  |           |
   | 3.3.4                  |           |
   | 3.3.5                  |           |
   | 3.3.6                  |           |
   | 3.3.7                  |           |
   | 3.4.0                  |           |
   | 3.4-dev                |           |
   | 3.4.1                  |           |
   | 3.4.2                  |           |
   | 3.4.3                  |           |
   | 3.4.4                  |           |
   | 3.4.5                  |           |
   | 3.4.6                  |           |
   | 3.4.7                  |           |
   | 3.4.8                  |           |
   | 3.4.9                  |           |
   | 3.4.10                 |           |
   | 3.5.0                  |           |
   | 3.5-dev                |           |
   | 3.5.1                  |           |
   | 3.5.2                  |           |
   | 3.5.3                  |           |
   | 3.5.4                  |           |
   | 3.5.5                  |           |
   | 3.5.6                  |           |
   | 3.5.7                  |           |
   | 3.5.8                  |           |
   | 3.5.9                  |           |
   | 3.5.10                 |           |
   | 3.6.0                  |           |
   | 3.6-dev                |           |
   | 3.6.1                  |           |
   | 3.6.2                  |           |
   | 3.6.3                  |           |
   | 3.6.4                  |           |
   | 3.6.5                  |           |
   | 3.6.6                  |           |
   | 3.6.7                  |           |
   | 3.6.8                  |           |
   | 3.6.9                  |           |
   | 3.6.10                 |           |
   | 3.6.11                 |           |
   | 3.6.12                 |           |
   | 3.6.13                 |           |
   | 3.6.14                 |           |
   | 3.6.15                 |           |
   | 3.7.0                  |           |
   | 3.7-dev                |           |
   | 3.7.1                  |           |
   | 3.7.2                  |           |
   | 3.7.3                  |           |
   | 3.7.4                  |           |
   | 3.7.5                  |           |
   | 3.7.6                  |           |
   | 3.7.7                  |           |
   | 3.7.8                  |           |
   | 3.7.9                  |           |
   | 3.7.10                 |           |
   | 3.7.11                 |           |
   | 3.7.12                 |           |
   | 3.8.0                  |           |
   | 3.8-dev                |           |
   | 3.8.1                  |           |
   | 3.8.2                  |           |
   | 3.8.3                  |           |
   | 3.8.4                  |           |
   | 3.8.5                  |           |
   | 3.8.6                  |           |
   | 3.8.7                  |           |
   | 3.8.8                  |           |
   | 3.8.9                  |           |
   | 3.8.10                 |           |
   | 3.8.11                 |           |
   | 3.8.12                 |           |
   | 3.9.0                  |           |
   | 3.9-dev                |           |
   | 3.9.1                  |           |
   | 3.9.2                  |           |
   | 3.9.4                  |           |
   | 3.9.5                  |           |
   | 3.9.6                  |           |
   | 3.9.7                  |           |
   | 3.9.8                  |           |
   | 3.9.9                  |           |
   | 3.9.10                 |           |
   | 3.10.0                 |           |
   | 3.10-dev               |           |
   | 3.10.1                 |           |
   | 3.10.2                 |           |
   | 3.11.0a5               |           |
   | 3.11-dev               |           |
   | activepython-2.7.14    |           |
   | activepython-3.5.4     |           |
   | activepython-3.6.0     |           |
   | anaconda-1.4.0         |           |
   | anaconda-1.5.0         |           |
   | anaconda-1.5.1         |           |
   | anaconda-1.6.0         |           |
   | anaconda-1.6.1         |           |
   | anaconda-1.7.0         |           |
   | anaconda-1.8.0         |           |
   | anaconda-1.9.0         |           |
   | anaconda-1.9.1         |           |
   | anaconda-1.9.2         |           |
   | anaconda-2.0.0         |           |
   | anaconda-2.0.1         |           |
   | anaconda-2.1.0         |           |
   | anaconda-2.2.0         |           |
   | anaconda-2.3.0         |           |
   | anaconda-2.4.0         |           |
   | anaconda-4.0.0         |           |
   | anaconda2-2.4.0        |           |
   | anaconda2-2.4.1        |           |
   | anaconda2-2.5.0        |           |
   | anaconda2-4.0.0        |           |
   | anaconda2-4.1.0        |           |
   | anaconda2-4.1.1        |           |
   | anaconda2-4.2.0        |           |
   | anaconda2-4.3.0        |           |
   | anaconda2-4.3.1        |           |
   | anaconda2-4.4.0        |           |
   | anaconda2-5.0.0        |           |
   | anaconda2-5.0.1        |           |
   | anaconda2-5.1.0        |           |
   | anaconda2-5.2.0        |           |
   | anaconda2-5.3.0        |           |
   | anaconda2-5.3.1        |           |
   | anaconda2-2018.12      |           |
   | anaconda2-2019.03      |           |
   | anaconda2-2019.07      |           |
   | anaconda3-2.0.0        |           |
   | anaconda3-2.0.1        |           |
   | anaconda3-2.1.0        |           |
   | anaconda3-2.2.0        |           |
   | anaconda3-2.3.0        |           |
   | anaconda3-2.4.0        |           |
   | anaconda3-2.4.1        |           |
   | anaconda3-2.5.0        |           |
   | anaconda3-4.0.0        |           |
   | anaconda3-4.1.0        |           |
   | anaconda3-4.1.1        |           |
   | anaconda3-4.2.0        |           |
   | anaconda3-4.3.0        |           |
   | anaconda3-4.3.1        |           |
   | anaconda3-4.4.0        |           |
   | anaconda3-5.0.0        |           |
   | anaconda3-5.0.1        |           |
   | anaconda3-5.1.0        |           |
   | anaconda3-5.2.0        |           |
   | anaconda3-5.3.0        |           |
   | anaconda3-5.3.1        |           |
   | anaconda3-2018.12      |           |
   | anaconda3-2019.03      |           |
   | anaconda3-2019.07      |           |
   | anaconda3-2019.10      |           |
   | anaconda3-2020.02      |           |
   | anaconda3-2020.07      |           |
   | anaconda3-2020.11      |           |
   | anaconda3-2021.05      |           |
   | anaconda3-2021.11      |           |
   | graalpython-20.1.0     |           |
   | graalpython-20.2.0     |           |
   | graalpython-20.3.0     |           |
   | graalpython-21.0.0     |           |
   | graalpython-21.1.0     |           |
   | graalpython-21.2.0     |           |
   | graalpython-21.3.0     |           |
   | graalpython-22.0.0     |           |
   | ironpython-dev         |           |
   | ironpython-2.7.4       |           |
   | ironpython-2.7.5       |           |
   | ironpython-2.7.6.3     |           |
   | ironpython-2.7.7       |           |
   | jython-dev             |           |
   | jython-2.5.0           |           |
   | jython-2.5-dev         |           |
   | jython-2.5.1           |           |
   | jython-2.5.2           |           |
   | jython-2.5.3           |           |
   | jython-2.5.4-rc1       |           |
   | jython-2.7.0           |           |
   | jython-2.7.1           |           |
   | jython-2.7.2           |           |
   | mambaforge-pypy3       |           |
   | mambaforge             |           |
   | mambaforge-4.10.1-4    |           |
   | mambaforge-4.10.1-5    |           |
   | mambaforge-4.10.3-10   |           |
   | micropython-dev        |           |
   | micropython-1.9.3      |           |
   | micropython-1.9.4      |           |
   | micropython-1.10       |           |
   | micropython-1.11       |           |
   | micropython-1.12       |           |
   | micropython-1.13       |           |
   | micropython-1.14       |           |
   | micropython-1.15       |           |
   | micropython-1.16       |           |
   | micropython-1.17       |           |
   | miniconda-latest       |           |
   | miniconda-2.2.2        |           |
   | miniconda-3.0.0        |           |
   | miniconda-3.0.4        |           |
   | miniconda-3.0.5        |           |
   | miniconda-3.3.0        |           |
   | miniconda-3.4.2        |           |
   | miniconda-3.7.0        |           |
   | miniconda-3.8.3        |           |
   | miniconda-3.9.1        |           |
   | miniconda-3.10.1       |           |
   | miniconda-3.16.0       |           |
   | miniconda-3.18.3       |           |
   | miniconda2-latest      |           |
   | miniconda2-2.7-4.8.3   |           |
   | miniconda2-3.18.3      |           |
   | miniconda2-3.19.0      |           |
   | miniconda2-4.0.5       |           |
   | miniconda2-4.1.11      |           |
   | miniconda2-4.3.14      |           |
   | miniconda2-4.3.21      |           |
   | miniconda2-4.3.27      |           |
   | miniconda2-4.3.30      |           |
   | miniconda2-4.3.31      |           |
   | miniconda2-4.4.10      |           |
   | miniconda2-4.5.1       |           |
   | miniconda2-4.5.4       |           |
   | miniconda2-4.5.11      |           |
   | miniconda2-4.5.12      |           |
   | miniconda2-4.6.14      |           |
   | miniconda2-4.7.10      |           |
   | miniconda2-4.7.12      |           |
   | miniconda3-latest      |           |
   | miniconda3-2.2.2       |           |
   | miniconda3-3.0.0       |           |
   | miniconda3-3.0.4       |           |
   | miniconda3-3.0.5       |           |
   | miniconda3-3.3.0       |           |
   | miniconda3-3.4.2       |           |
   | miniconda3-3.7.0       |           |
   | miniconda3-3.7-4.8.2   |           |
   | miniconda3-3.7-4.8.3   |           |
   | miniconda3-3.7-4.9.2   |           |
   | miniconda3-3.7-4.10.3  |           |
   | miniconda3-3.8.3       |           |
   | miniconda3-3.8-4.8.2   |           |
   | miniconda3-3.8-4.8.3   |           |
   | miniconda3-3.8-4.9.2   |           |
   | miniconda3-3.8-4.10.3  |           |
   | miniconda3-3.9.1       |           |
   | miniconda3-3.9-4.9.2   |           |
   | miniconda3-3.9-4.10.3  |           |
   | miniconda3-3.10.1      |           |
   | miniconda3-3.16.0      |           |
   | miniconda3-3.18.3      |           |
   | miniconda3-3.19.0      |           |
   | miniconda3-4.0.5       |           |
   | miniconda3-4.1.11      |           |
   | miniconda3-4.2.12      |           |
   | miniconda3-4.3.11      |           |
   | miniconda3-4.3.14      |           |
   | miniconda3-4.3.21      |           |
   | miniconda3-4.3.27      |           |
   | miniconda3-4.3.30      |           |
   | miniconda3-4.3.31      |           |
   | miniconda3-4.4.10      |           |
   | miniconda3-4.5.1       |           |
   | miniconda3-4.5.4       |           |
   | miniconda3-4.5.11      |           |
   | miniconda3-4.5.12      |           |
   | miniconda3-4.6.14      |           |
   | miniconda3-4.7.10      |           |
   | miniconda3-4.7.12      |           |
   | miniforge-pypy3        |           |
   | miniforge3             |           |
   | miniforge3-4.9.2       |           |
   | miniforge3-4.10        |           |
   | miniforge3-4.10.1-1    |           |
   | miniforge3-4.10.1-3    |           |
   | miniforge3-4.10.1-5    |           |
   | miniforge3-4.10.3-10   |           |
   | pypy-c-jit-latest      |           |
   | pypy-dev               |           |
   | pypy-stm-2.3           |           |
   | pypy-stm-2.5.1         |           |
   | pypy-1.5-src           |           |
   | pypy-1.6               |           |
   | pypy-1.7               |           |
   | pypy-1.8               |           |
   | pypy-1.9               |           |
   | pypy-2.0-src           |           |
   | pypy-2.0               |           |
   | pypy-2.0.1-src         |           |
   | pypy-2.0.1             |           |
   | pypy-2.0.2-src         |           |
   | pypy-2.0.2             |           |
   | pypy-2.1-src           |           |
   | pypy-2.1               |           |
   | pypy-2.2-src           |           |
   | pypy-2.2               |           |
   | pypy-2.2.1-src         |           |
   | pypy-2.2.1             |           |
   | pypy-2.3-src           |           |
   | pypy-2.3               |           |
   | pypy-2.3.1-src         |           |
   | pypy-2.3.1             |           |
   | pypy-2.4.0-src         |           |
   | pypy-2.4.0             |           |
   | pypy-2.5.0-src         |           |
   | pypy-2.5.0             |           |
   | pypy-2.5.1-src         |           |
   | pypy-2.5.1             |           |
   | pypy-2.6.0-src         |           |
   | pypy-2.6.0             |           |
   | pypy-2.6.1-src         |           |
   | pypy-2.6.1             |           |
   | pypy-4.0.0-src         |           |
   | pypy-4.0.0             |           |
   | pypy-4.0.1-src         |           |
   | pypy-4.0.1             |           |
   | pypy-5.0.0-src         |           |
   | pypy-5.0.0             |           |
   | pypy-5.0.1-src         |           |
   | pypy-5.0.1             |           |
   | pypy-5.1-src           |           |
   | pypy-5.1               |           |
   | pypy-5.1.1-src         |           |
   | pypy-5.1.1             |           |
   | pypy-5.3-src           |           |
   | pypy-5.3               |           |
   | pypy-5.3.1-src         |           |
   | pypy-5.3.1             |           |
   | pypy-5.4-src           |           |
   | pypy-5.4               |           |
   | pypy-5.4.1-src         |           |
   | pypy-5.4.1             |           |
   | pypy-5.6.0-src         |           |
   | pypy-5.6.0             |           |
   | pypy-5.7.0-src         |           |
   | pypy-5.7.0             |           |
   | pypy-5.7.1-src         |           |
   | pypy-5.7.1             |           |
   | pypy2-5.3-src          |           |
   | pypy2-5.3              |           |
   | pypy2-5.3.1-src        |           |
   | pypy2-5.3.1            |           |
   | pypy2-5.4-src          |           |
   | pypy2-5.4              |           |
   | pypy2-5.4.1-src        |           |
   | pypy2-5.4.1            |           |
   | pypy2-5.6.0-src        |           |
   | pypy2-5.6.0            |           |
   | pypy2-5.7.0-src        |           |
   | pypy2-5.7.0            |           |
   | pypy2-5.7.1-src        |           |
   | pypy2-5.7.1            |           |
   | pypy2.7-5.8.0-src      |           |
   | pypy2.7-5.8.0          |           |
   | pypy2.7-5.9.0-src      |           |
   | pypy2.7-5.9.0          |           |
   | pypy2.7-5.10.0-src     |           |
   | pypy2.7-5.10.0         |           |
   | pypy2.7-6.0.0-src      |           |
   | pypy2.7-6.0.0          |           |
   | pypy2.7-7.0.0-src      |           |
   | pypy2.7-7.0.0          |           |
   | pypy2.7-7.1.0-src      |           |
   | pypy2.7-7.1.0          |           |
   | pypy2.7-7.1.1-src      |           |
   | pypy2.7-7.1.1          |           |
   | pypy2.7-7.2.0-src      |           |
   | pypy2.7-7.2.0          |           |
   | pypy2.7-7.3.0-src      |           |
   | pypy2.7-7.3.0          |           |
   | pypy2.7-7.3.1-src      |           |
   | pypy2.7-7.3.1          |           |
   | pypy2.7-7.3.2-src      |           |
   | pypy2.7-7.3.2          |           |
   | pypy2.7-7.3.3-src      |           |
   | pypy2.7-7.3.3          |           |
   | pypy2.7-7.3.4-src      |           |
   | pypy2.7-7.3.4          |           |
   | pypy2.7-7.3.5-src      |           |
   | pypy2.7-7.3.5          |           |
   | pypy2.7-7.3.6-src      |           |
   | pypy2.7-7.3.6          |           |
   | pypy3-2.3.1-src        |           |
   | pypy3-2.3.1            |           |
   | pypy3-2.4.0-src        |           |
   | pypy3-2.4.0            |           |
   | pypy3.3-5.2-alpha1-src |           |
   | pypy3.3-5.2-alpha1     |           |
   | pypy3.3-5.5-alpha-src  |           |
   | pypy3.3-5.5-alpha      |           |
   | pypy3.5-c-jit-latest   |           |
   | pypy3.5-5.7-beta-src   |           |
   | pypy3.5-5.7-beta       |           |
   | pypy3.5-5.7.1-beta-src |           |
   | pypy3.5-5.7.1-beta     |           |
   | pypy3.5-5.8.0-src      |           |
   | pypy3.5-5.8.0          |           |
   | pypy3.5-5.9.0-src      |           |
   | pypy3.5-5.9.0          |           |
   | pypy3.5-5.10.0-src     |           |
   | pypy3.5-5.10.0         |           |
   | pypy3.5-5.10.1-src     |           |
   | pypy3.5-5.10.1         |           |
   | pypy3.5-6.0.0-src      |           |
   | pypy3.5-6.0.0          |           |
   | pypy3.5-7.0.0-src      |           |
   | pypy3.5-7.0.0          |           |
   | pypy3.6-7.0.0-src      |           |
   | pypy3.6-7.0.0          |           |
   | pypy3.6-7.1.0-src      |           |
   | pypy3.6-7.1.0          |           |
   | pypy3.6-7.1.1-src      |           |
   | pypy3.6-7.1.1          |           |
   | pypy3.6-7.2.0-src      |           |
   | pypy3.6-7.2.0          |           |
   | pypy3.6-7.3.0-src      |           |
   | pypy3.6-7.3.0          |           |
   | pypy3.6-7.3.1-src      |           |
   | pypy3.6-7.3.1          |           |
   | pypy3.6-7.3.2-src      |           |
   | pypy3.6-7.3.2          |           |
   | pypy3.6-7.3.3-src      |           |
   | pypy3.6-7.3.3          |           |
   | pypy3.7-c-jit-latest   |           |
   | pypy3.7-7.3.2-src      |           |
   | pypy3.7-7.3.2          |           |
   | pypy3.7-7.3.3-src      |           |
   | pypy3.7-7.3.3          |           |
   | pypy3.7-7.3.4-src      |           |
   | pypy3.7-7.3.4          |           |
   | pypy3.7-7.3.5-src      |           |
   | pypy3.7-7.3.5          |           |
   | pypy3.7-7.3.6-src      |           |
   | pypy3.7-7.3.6          |           |
   | pypy3.7-7.3.7-src      |           |
   | pypy3.7-7.3.7          |           |
   | pypy3.8-7.3.6-src      |           |
   | pypy3.8-7.3.6          |           |
   | pypy3.8-7.3.7-src      |           |
   | pypy3.8-7.3.7          |           |
   | pyston-2.2             |           |
   | pyston-2.3             |           |
   | pyston-2.3.1           |           |
   | pyston-2.3.2           |           |
   | stackless-dev          |           |
   | stackless-2.7-dev      |           |
   | stackless-2.7.2        |           |
   | stackless-2.7.3        |           |
   | stackless-2.7.4        |           |
   | stackless-2.7.5        |           |
   | stackless-2.7.6        |           |
   | stackless-2.7.7        |           |
   | stackless-2.7.8        |           |
   | stackless-2.7.9        |           |
   | stackless-2.7.10       |           |
   | stackless-2.7.11       |           |
   | stackless-2.7.12       |           |
   | stackless-2.7.14       |           |
   | stackless-2.7.16       |           |
   | stackless-3.2.2        |           |
   | stackless-3.2.5        |           |
   | stackless-3.3.5        |           |
   | stackless-3.3.7        |           |
   | stackless-3.4-dev      |           |
   | stackless-3.4.2        |           |
   | stackless-3.4.7        |           |
   | stackless-3.5.4        |           |
   | stackless-3.7.5        |           |

   #+begin_src bash
     pyenv virtualenv 3.10.2 django-virtual-enviroment
   #+end_src

   #+RESULTS:
   1. activate it
      =M-x python-workon= pick *django-virtual-enviroment*
   2. create a ~.python-version~
      #+begin_src bash
	cat ./.python-version
      #+end_src

      #+RESULTS:
      : django-virtual-enviroment
4. create a ~.gitignore~
   #+begin_src bash
     # Byte-compiled / optimized / DLL files
     __pycache__/
     ,*.py[cod]
     ,*$py.class

     # C extensions
     ,*.so

     # Distribution / packaging
     .Python
     build/
     develop-eggs/
     dist/
     downloads/
     eggs/
     .eggs/
     lib/
     lib64/
     parts/
     sdist/
     var/
     wheels/
     pip-wheel-metadata/
     share/python-wheels/
     ,*.egg-info/
     .installed.cfg
     ,*.egg
     MANIFEST

     # PyInstaller
     #  Usually these files are written by a python script from a template
     #  before PyInstaller builds the exe, so as to inject date/other infos into it.
     ,*.manifest
     ,*.spec

     # Installer logs
     pip-log.txt
     pip-delete-this-directory.txt

     # Unit test / coverage reports
     htmlcov/
     .tox/
     .nox/
     .coverage
     .coverage.*
     .cache
     nosetests.xml
     coverage.xml
     ,*.cover
     ,*.py,cover
     .hypothesis/
     .pytest_cache/

     # Translations
     ,*.mo
     ,*.pot

     # Django stuff:
     ,*.log
     local_settings.py
     db.sqlite3
     db.sqlite3-journal

     # Flask stuff:
     instance/
     .webassets-cache

     # Scrapy stuff:
     .scrapy

     # Sphinx documentation
     docs/_build/

     # PyBuilder
     target/

     # Jupyter Notebook
     .ipynb_checkpoints

     # IPython
     profile_default/
     ipython_config.py

     # pyenv
     .python-version

     # pipenv
     #   According to pypa/pipenv#598, it is recommended to include Pipfile.lock in version control.
     #   However, in case of collaboration, if having platform-specific dependencies or dependencies
     #   having no cross-platform support, pipenv may install dependencies that don't work, or not
     #   install all needed dependencies.
     #Pipfile.lock

     # PEP 582; used by e.g. github.com/David-OConnor/pyflow
     __pypackages__/

     # Celery stuff
     celerybeat-schedule
     celerybeat.pid

     # SageMath parsed files
     ,*.sage.py

     # Environments
     .env
     .venv
     env/
     venv/
     ENV/
     env.bak/
     venv.bak/

     # Spyder project settings
     .spyderproject
     .spyproject

     # Rope project settings
     .ropeproject

     # mkdocs documentation
     /site

     # mypy
     .mypy_cache/
     .dmypy.json
     dmypy.json

     # Pyre type checker
     .pyre/

     # Compiled
     ,*.elc

     # Packaging
     .cask

     # Backup files
     ,*~

     # Undo-tree save-files
     ,*.~undo-tree
   #+end_src
5. commits and push
   1. =C-x g= follow the instructions create first repository, new
      buffer will be open
   2. *stage* and *commits*
      1. =S=
      2. =c= =c=
      3. =C-c C-c=
   3. rename the branch in *main*
   4. add the remote branch:
      1. =M=
      2. =a=
      3. =origin=
      4. https://github.com/littl3-R/django_zth.git
      5. =y=
   5. push
      1. =P=
      2. =p=
      3. insert password
6. install *django* and check if it works
   #+begin_src bash
     python -m pip install Django
   #+end_src

   #+RESULTS:
   | Collecting   | Django                        |                                 |               |                |        |
   | Downloading  | Django-4.0.4-py3-none-any.whl | (8.0                            | MB)           |                |        |
   | Collecting   | sqlparse>=0.2.2               |                                 |               |                |        |
   | Using        | cached                        | sqlparse-0.4.2-py3-none-any.whl | (42           | kB)            |        |
   | Collecting   | asgiref<4,>=3.4.1             |                                 |               |                |        |
   | Using        | cached                        | asgiref-3.5.0-py3-none-any.whl  | (22           | kB)            |        |
   | Installing   | collected                     | packages:                       | sqlparse,     | asgiref,       | Django |
   | Successfully | installed                     | Django-4.0.4                    | asgiref-3.5.0 | sqlparse-0.4.2 |        |

   #+begin_src bash
     python
     import django
     print(django.get_version())
   #+end_src

  #+RESULTS:
  : 4.0.4
