README.md


<a id="orgfe27993"></a>

# first Django app


<a id="orge0a8116"></a>

## create a project

    django-admin startproject mysite

    tree ./mysite/

The `__init__.py` file tells to django that this is a [package in python](https://docs.python.org/3/tutorial/modules.html#tut-packages)


<a id="org528dc86"></a>

## run dev server

    python mysite/manage.py runserver # you can run in .org too


<a id="org971bb42"></a>

## create an app

    cd mysite
    python manage.py startapp polls

    tree ./mysite/polls/


<a id="org9adfd7d"></a>

# &#x2026;continue

The project and the first app are set them up, form now I'll write the
files directly instead editing the .org


<a id="org61e3ed9"></a>

## some notes

The `include()` function allows referencing the URLconfs.

The migrate command looks at the **INSTALLED<sub>APPS</sub>** setting and creates
any necessary database tables according to the database settings in
your mysite/settings.py

Once you have create or updated the `models.py` and `migrate` you have
to add the new app in django. See the `polls/apps.py`

This command is helpful:

    python mysite/manage.py check

this checks for any problems in the project


<a id="orgba8c44c"></a>

# playing with the API

    python mysite/manage.py shell

    >>> from polls.models import Question, Choice
    >>> Question.objects.all()
    >>> Question.objects.all()
    <QuerySet []>
    >>> from django.utils import timezone
    >>> timezone.now()
    datetime.datetime(2022, 4, 19, 16, 35, 38, 486045, tzinfo=datetime.timezone.utc)
    >>> q = Question(question_text="What's new?", pub_date=timezone.now())
    >>> q
    <Question: Question object (None)>
    >>> q.save()
    >>> q
    <Question: Question object (1)>
    >>> q.id
    1
    >>> q.pub_date
    datetime.datetime(2022, 4, 19, 16, 36, 13, 941778, tzinfo=datetime.timezone.utc)
    >>> q.question_text
    "What's new?"
    >>> q.question_text = "What's up?"
    >>> q.save()
    >>> Questio.objects.all()
    Traceback (most recent call last):
      File "<console>", line 1, in <module>
    NameError: name 'Questio' is not defined
    >>> Questions.objects.all()
    Traceback (most recent call last):
      File "<console>", line 1, in <module>
    NameError: name 'Questions' is not defined
    >>> Question.objects.all()
    <QuerySet [<Question: Question object (1)>]>
    >>>


<a id="orgdf4e4cf"></a>

# site admin

    python manage.py createsuperuser

